# Created 2018-06-16 Sat 19:18
#+TITLE: Org Syntax Notes
#+DATE: <2018-02-25 Sun>
#+AUTHOR: Brian Smith
***** STARS

#+NAME: STARS
#+BEGIN_SRC css
  ^([*]+(?=\s))
#+END_SRC

#+RESULTS: 
:   =STARS= is a string starting at column 0, containing at least one
:   asterisk (and up to ~org-inlinetask-min-level~ if =org-inlinetask=
:   library is loaded) and ended by a space character.  The number of
:   asterisks is used to define the level of the headline.  It's the
:   sole compulsory part of a headline.

#+RESULTS: 
#+BEGIN_SRC js
  /^([*]+(?=\s))/
  [ '****',
    '****',
    index: 0,
    input: '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    groups: undefined ]
#+END_SRC

***** KEYWORD

#+NAME: KEYWORD
#+BEGIN_SRC css
  (( +)(TODO|DONE))
#+END_SRC

#+RESULTS: 
:   =KEYWORD= is a =TODO= keyword, which has to belong to the list defined
:   in ~org-todo-keywords-1~.  Case is significant.

#+RESULTS: 
#+BEGIN_SRC js
  /^([*]+(?=\s))(( +)(TODO|DONE))/
  [ '**** DONE',
    '****',
    ' DONE',
    ' ',
    'DONE',
    index: 0,
    input: '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    groups: undefined ]
#+END_SRC

***** PRIORITY

#+NAME: PRIORITY
#+BEGIN_SRC css
  (( +)(\[#[a-zA-Z]\]))
#+END_SRC

#+RESULTS: 
:RESULTS:
=PRIORITY= is a priority cookie, i.e. a single letter preceded by
a hash sign # and enclosed within square brackets.
:END:

#+RESULTS: 
#+BEGIN_SRC js
  /^([*]+(?=\s))(( +)(TODO|DONE))(( +)(\[#[a-zA-Z]\]))/
  [ '**** DONE [#A]',
    '****',
    ' DONE',
    ' ',
    'DONE',
    ' [#A]',
    ' ',
    '[#A]',
    index: 0,
    input: '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    groups: undefined ]
#+END_SRC

***** TITLE [0/2]

#+NAME: TITLE
#+BEGIN_SRC css
  (( +)(.+))
#+END_SRC

#+RESULTS: 
:   =TITLE= can be made of any character but a new line.  Though, it will
:   match after every other part have been matched.

#+RESULTS: 
#+BEGIN_SRC js
  /^([*]+(?=\s))(( +)(TODO|DONE))(( +)(\[#[a-zA-Z]\]))(( +)(.+))/
  [ '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    '****',
    ' DONE',
    ' ',
    'DONE',
    ' [#A]',
    ' ',
    '[#A]',
    ' *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    ' ',
    '*this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    index: 0,
    input: '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    groups: undefined ]
#+END_SRC

- [ ] Add TITLE begins with =COMMENT= to regular expression

  #+RESULTS: 
  :   If the first word appearing in the title is =COMMENT=, the headline
  :   will be considered as "commented".  Case is significant.

- [ ] Add TITLE is =Footnotes= to regular expression

  #+RESULTS: 
  :   If its title is ~org-footnote-section~, it will be considered as
  :   a "footnote section".  Case is significant.

***** TAGS [0/2]

#+NAME: TAGS
#+BEGIN_SRC css
  (( +)(([:\w@#%]+))+)
#+END_SRC

#+RESULTS: 
:   =TAGS= is made of words containing any alpha-numeric character,
:   underscore, at sign, hash sign or percent sign, and separated with
:   colons.

: ( +(([:\\w@#%]+))+))?
: orig "^(?:[*]+) (?:TODO|DONE)? (?:\\[#[a-zA-Z]\\])? (?:.+)? (([:\\w@#%]+))+"
: (concat (org-sbe STARS) (org-sbe KEYWORD) (org-sbe PRIORITY) (org-sbe TITLE) (org-sbe TAGS))

#+RESULTS: 
#+BEGIN_SRC js
  /^([*]+(?=\s))(( +)(TODO|DONE))(( +)(\[#[a-zA-Z]\]))(( +)(.+))(( +)(([:\w@#%]+))+)/
  [ '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    '****',
    ' DONE',
    ' ',
    'DONE',
    ' [#A]',
    ' ',
    '[#A]',
    ' *this* /is/ _the_ =title= +of+ ~my~ headline :notattag:',
    ' ',
    '*this* /is/ _the_ =title= +of+ ~my~ headline :notattag:',
    ' :tag1:@tag2:#tag3:%TAG4#:',
    ' ',
    ':tag1:@tag2:#tag3:%TAG4#:',
    ':tag1:@tag2:#tag3:%TAG4#:',
    index: 0,
    input: '**** DONE [#A] *this* /is/ _the_ =title= +of+ ~my~ headline :notattag: :tag1:@tag2:#tag3:%TAG4#:',
    groups: undefined ]
#+END_SRC

- [ ] Add =[:]ARCHIVE[:]= tag to regular expression 

  #+RESULTS: 
  :   If =ARCHIVE= is one of its tags, it will be considered as
  :   "archived".  Case is significant.

- [ ] Fix empty tag match, i.e. =::=, in regular expression

******* Example Usage

#+BEGIN_SRC ruby
  def grammar_include_patterns(patterns, excluding=[], indent=0)
    padding = ' ' * indent
  
    filtered = patterns - excluding
    filtered.map { |p|
    [%Q<#{padding}{>,%Q<#{padding}  'include': '##{p}'>,%Q<#{padding}}>].join("\n")
    }.join("\n")
  
  end
  
  grammar_include_patterns(include_patterns, ["notme"], 8)
#+END_SRC

#+RESULTS: 
:         {
:           'include': '#bold'
:         }
:         {
:           'include': '#italic'
:         }

